# EndConnectionType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..EndConnectionType Property
StairsType Class See Also
---
The join style between a run and landing.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public StairsEndConnectionType EndConnectionType { get; set; }
```

Visual Basic
---
```text
Public Property EndConnectionType As StairsEndConnectionType
	Get
	Set
```

Visual C++
---
```text
public:
property StairsEndConnectionType EndConnectionType {
	StairsEndConnectionType get ();
	void set (StairsEndConnectionType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace